; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Block grouping domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; A number of blocks of different colours lie on a grid-like environment.
;;; The objective is to group the blocks by colour, i.e. to have all blocks
;;; of the same color in the same cell, which is at the same time
;;; different to the cell where blocks of other colors are:
;;;
;;; forall i, j color(i) = color(j) <=> loc(i) = loc(j)
;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain mt-bonbon-tray)
    ;(:requirements :typing )
    (:types bonbon - object )
    (:functions
        (lane ?b - bonbon)  ;; The position of a block
        (tier ?b - bonbon)  ;;
        (max_lane)
        (min_lane)
        (max_tier)
        (min_tier)
    )

    ;; Move a block from its location to an adjacent location
    (:action slide_bonbon_up
     :parameters (?b - bonbon)
     :precondition (and (<= (+ (tier ?b)1) (max_tier) ))
     :effect (and
        (increase (tier ?b) 1)
    ))

    (:action slide_bonbon_down
     :parameters (?b - bonbon)
     :precondition (and (>= (- (tier ?b) 1) (min_tier) ))
     :effect (and
        (decrease (tier ?b) 1)
    ))

    (:action slide_bonbon_right
     :parameters (?b - bonbon)
     :precondition (and (<= (+ (lane ?b)1) (max_lane) ))
     :effect (and
        (increase (lane ?b) 1)
    ))

    (:action slide_bonbon_left
     :parameters (?b - bonbon)
     :precondition (and (>= (- (lane ?b) 1) (min_lane) ))
     :effect (and
        (decrease (lane ?b) 1)
    ))

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_20_5_2_1)
  (:domain mt-bonbon-tray)
  (:objects
    bonbon1 bonbon2 bonbon3 bonbon4 bonbon5 - bonbon
  )

  (:init
    (= (lane bonbon3) 17)
  (= (tier bonbon3) 14)
  (= (lane bonbon4) 17)
  (= (tier bonbon4) 8)
  (= (lane bonbon2) 19)
  (= (tier bonbon2) 5)
  (= (lane bonbon1) 20)
  (= (tier bonbon1) 14)
  (= (lane bonbon5) 5)
  (= (tier bonbon5) 5)
  (= (max_lane) 20 )
  (= (min_lane) 1 )
  (= (max_tier) 20 )
  (= (min_tier) 1 )
  )

  (:goal (and
    (= (lane bonbon1) (lane bonbon2))
(= (tier bonbon1) (tier bonbon2))
  (= (lane bonbon1) (lane bonbon3))
(= (tier bonbon1) (tier bonbon3))
  (= (lane bonbon1) (lane bonbon4))
(= (tier bonbon1) (tier bonbon4))
  (or (not (= (lane bonbon1) (lane bonbon5))) (not (= (tier bonbon1) (tier bonbon5))))
  (= (lane bonbon2) (lane bonbon3))
(= (tier bonbon2) (tier bonbon3))
  (= (lane bonbon2) (lane bonbon4))
(= (tier bonbon2) (tier bonbon4))
  (or (not (= (lane bonbon2) (lane bonbon5))) (not (= (tier bonbon2) (tier bonbon5))))
  (= (lane bonbon3) (lane bonbon4))
(= (tier bonbon3) (tier bonbon4))
  (or (not (= (lane bonbon3) (lane bonbon5))) (not (= (tier bonbon3) (tier bonbon5))))
  (or (not (= (lane bonbon4) (lane bonbon5))) (not (= (tier bonbon4) (tier bonbon5))))
  ))





)

; plan
1. (slide_bonbon_up bonbon2)
   changed: (tier bonbon2) from 5 to 6
   goals met: 6 of 16
2. (slide_bonbon_up bonbon2)
   changed: (tier bonbon2) from 6 to 7
   goals met: 6 of 16
3. (slide_bonbon_up bonbon2)
   changed: (tier bonbon2) from 7 to 8
   goals met: 7 of 16
4. (slide_bonbon_left bonbon1)
   changed: (lane bonbon1) from 20 to 19
   goals met: 8 of 16
5. (slide_bonbon_up bonbon4)
   changed: (tier bonbon4) from 8 to 9
   goals met: 7 of 16
6. (slide_bonbon_up bonbon2)
   changed: (tier bonbon2) from 8 to 9
   goals met: 8 of 16
7. (slide_bonbon_up bonbon4)
   changed: (tier bonbon4) from 9 to 10
   goals met: 7 of 16
8. (slide_bonbon_up bonbon2)
   changed: (tier bonbon2) from 9 to 10
   goals met: 8 of 16
9. (slide_bonbon_up bonbon4)
   changed: (tier bonbon4) from 10 to 11
   goals met: 7 of 16
10. (slide_bonbon_up bonbon2)
   changed: (tier bonbon2) from 10 to 11
   goals met: 8 of 16
11. (slide_bonbon_up bonbon4)
   changed: (tier bonbon4) from 11 to 12
   goals met: 7 of 16
12. (slide_bonbon_up bonbon2)
   changed: (tier bonbon2) from 11 to 12
   goals met: 8 of 16
13. (slide_bonbon_up bonbon4)
   changed: (tier bonbon4) from 12 to 13
   goals met: 7 of 16
14. (slide_bonbon_up bonbon2)
   changed: (tier bonbon2) from 12 to 13
   goals met: 8 of 16
15. (slide_bonbon_up bonbon4)
   changed: (tier bonbon4) from 13 to 14
   goals met: 9 of 16
16. (slide_bonbon_up bonbon2)
   changed: (tier bonbon2) from 13 to 14
   goals met: 12 of 16
17. (slide_bonbon_right bonbon3)
   changed: (lane bonbon3) from 17 to 18
   goals met: 11 of 16
18. (slide_bonbon_right bonbon4)
   changed: (lane bonbon4) from 17 to 18
   goals met: 12 of 16
19. (slide_bonbon_right bonbon3)
   changed: (lane bonbon3) from 18 to 19
   goals met: 13 of 16
20. (slide_bonbon_right bonbon4)
   changed: (lane bonbon4) from 18 to 19
   goals met: 16 of 16
